_org/_posts/dev/2018-11-22-rails-activeadmin.org
#+begin_export html
---
layout: post
title: "Rails ActiveAdmin 学习"
date: 2018-11-22
categories: 程序设计
tags:
    - Rails
    - ActiveAdmin
---
#+end_export

* 安装

** 基础

#+BEGIN_EXAMPLE
    rails new auth
#+END_EXAMPLE

添加下面的 Gem 到 Gemfile

- activeadmin 后台管理
- devise：负责用户注册、登录、退出、找回密码等操作。
- cancancan：负责角色建立、对角色授权、在页面中根据授权是否显示元素，以及模型中超出授权时抛出异常。
- rolify：负责将用户与角色关联。
- draper：model 装饰，添加一个面向对象的表示逻辑层，增强性 helper。
- pundit：针对用户和类的权限管理。

#+BEGIN_SRC ruby
    gem 'activeadmin'
    gem 'devise'
    gem 'cancancan'
    gem 'rolify'
    # gem 'draper'
    # gem 'pundit'
#+END_SRC

#+BEGIN_EXAMPLE
    bundle install
#+END_EXAMPLE

** 生成 activeadmin 框架

其中包含了 devise

#+BEGIN_EXAMPLE
    rails g active_admin:install User
    rake db:migrate
    rake db:seed (添加一个用户 admin@example.com:password)
#+END_EXAMPLE

** 配置 rolify

#+BEGIN_EXAMPLE
    rails g rolify Role User
    rake db:migrate
#+END_EXAMPLE

为第一个用户添加角色, 运行 rails console

#+BEGIN_SRC ruby
    User.first.add_role :admin
    User.first.has_role? :admin
#+END_SRC

如果第二行返回为 true，
则表示角色设置成功了。另外需要再添加一个普通用户作为测试，同样在 rails
console 环境下处理

#+BEGIN_SRC ruby
    User.create!(email: 'general@example.com', password: 'password', password_confirmation: 'password')
#+END_SRC

** 本地化

#+BEGIN_SRC ruby
    # config/application.rb
    config.i18n.load_path += Dir[Rails.root.join('config', 'locales', '*',
            '*.{rb,yml}').to_s]
    config.i18n.default_locale = :"zh-CN"
#+END_SRC

按照 rails 风格，config/locales
就是放置语言包的地方，不建议更改。然后我们就可以利用这样的风格来管理语言包了。

#+BEGIN_EXAMPLE
    +locales--
     |+zh-CN
      |default.yml
      |devise.yml
      |..
     |+en
      |default.yml
      |devise.yml
      |..
#+END_EXAMPLE

** 配置 cancan

#+BEGIN_EXAMPLE
    rails g cancan:ability
#+END_EXAMPLE

配置 admin 可以干所有的事情，一般用户只能读取数据

#+BEGIN_SRC ruby
    # app/models/ability.rb
    if user.has_role? :admin
      can :manage, :all
    else
      can :read, :all
    end
#+END_SRC

** 为 activeadmin 配置 cancan 权限

这个应该是最重要的部分

#+BEGIN_SRC ruby
    # config/initialize/active_admin.rb
    config.authorization_adapter = ActiveAdmin::CanCanAdapter
    config.cancan_ability_class = "Ability"
    config.on_unauthorized_access = :access_denied
#+END_SRC

配置完上面的内容以后

#+BEGIN_SRC ruby
    # app/controller/application_controller.rb
    def access_denied(exception)
      redirect_to(users_path, alert: exception.message)
    end
#+END_SRC

#+BEGIN_SRC ruby
    # config/routes.rb
    root to: 'admin/dashboard#index'
#+END_SRC

** 配置邮件服务器

在开发环境下，需要配置下列内容：

#+BEGIN_SRC ruby
    # config/environments/development.rb:
    config.action_mailer.default_url_options = { host: 'localhost', port: 3000 }
#+END_SRC

** 配置信息提示页面

#+BEGIN_SRC ruby
    # app/views/layouts/application.html.erb

    <p class="notice"><%= notice %></p>
    <p class="alert"><%= alert %></p>
#+END_SRC

** 启动服务

#+BEGIN_EXAMPLE
    rails s
#+END_EXAMPLE

访问 http://localhost:3000/admin , 分别利用不同的用户登陆，进入 User
菜单，可以看到对 admin 和非 admin
用户所呈现的菜单是不一样的。一般用户只能读取，而 admin
用户可以修改，增加，删除。由此，activeadmin 对权限的支持也异常漂亮。


** 如果要关闭用户登录验证功能，可以用：

#+BEGIN_EXAMPLE
    # initializer/active_admin
    config.current_user_method = false
    config.authentication_method = false
#+END_EXAMPLE

** Comment

因为不需要 comment(注解)这个功能，所以在 initializer 中的 active_admin
中关闭这个功能

#+BEGIN_SRC ruby
    # For the entire application:
    ActiveAdmin.setup do |config|
      config.comments = false
    end

    # For a namespace:
    ActiveAdmin.setup do |config|
      config.namespace :admin do |admin|
        admin.comments = false
      end
    end

    # For a given resource:
    ActiveAdmin.register Post do
      config.comments = false
    end
#+END_SRC

