_posts/dev/2018-11-22-rails-activeadmin.html
---
layout: post
title: "Rails ActiveAdmin 学习"
date: 2018-11-22
categories: 程序设计
tags:
    - Rails
    - ActiveAdmin
---

<div id="outline-container-org54c93c3" class="outline-2">
<h2 id="org54c93c3"><span class="section-number-2">1</span> 安装</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org536a741" class="outline-3">
<h3 id="org536a741"><span class="section-number-3">1.1</span> 基础</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
rails new auth
</pre>

<p>
添加下面的 Gem 到 Gemfile
</p>

<ul class="org-ul">
<li>activeadmin 后台管理</li>
<li>devise：负责用户注册、登录、退出、找回密码等操作。</li>
<li>cancancan：负责角色建立、对角色授权、在页面中根据授权是否显示元素，以及模型中超出授权时抛出异常。</li>
<li>rolify：负责将用户与角色关联。</li>
<li>draper：model 装饰，添加一个面向对象的表示逻辑层，增强性 helper。</li>
<li>pundit：针对用户和类的权限管理。</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby">gem <span style="color: #2d9574;">'activeadmin'</span>
gem <span style="color: #2d9574;">'devise'</span>
gem <span style="color: #2d9574;">'cancancan'</span>
gem <span style="color: #2d9574;">'rolify'</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">gem 'draper'</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">gem 'pundit'</span>
</pre>
</div>

<pre class="example">
bundle install
</pre>
</div>
</div>

<div id="outline-container-org79928ad" class="outline-3">
<h3 id="org79928ad"><span class="section-number-3">1.2</span> 生成 activeadmin 框架</h3>
<div class="outline-text-3" id="text-1-2">
<p>
其中包含了 devise
</p>

<pre class="example">
rails g active_admin:install User
rake db:migrate
rake db:seed (添加一个用户 admin@example.com:password)
</pre>
</div>
</div>

<div id="outline-container-org72371c1" class="outline-3">
<h3 id="org72371c1"><span class="section-number-3">1.3</span> 配置 rolify</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
rails g rolify Role User
rake db:migrate
</pre>

<p>
为第一个用户添加角色, 运行 rails console
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #ce537a; font-weight: bold;">User</span>.first.add_role <span style="color: #a45bad;">:admin</span>
<span style="color: #ce537a; font-weight: bold;">User</span>.first.has_role? <span style="color: #a45bad;">:admin</span>
</pre>
</div>

<p>
如果第二行返回为 true，
则表示角色设置成功了。另外需要再添加一个普通用户作为测试，同样在 rails
console 环境下处理
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #ce537a; font-weight: bold;">User</span>.create!<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">email:</span> <span style="color: #2d9574;">'general@example.com'</span>, <span style="color: #a45bad;">password:</span> <span style="color: #2d9574;">'password'</span>, <span style="color: #a45bad;">password_confirmation:</span> <span style="color: #2d9574;">'password'</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org43b91b5" class="outline-3">
<h3 id="org43b91b5"><span class="section-number-3">1.4</span> 本地化</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">config/application.rb</span>
config.i18n.load_path += <span style="color: #ce537a; font-weight: bold;">Dir</span><span style="color: #4f97d7;">[</span><span style="color: #ce537a; font-weight: bold;">Rails</span>.root.join<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'config'</span>, <span style="color: #2d9574;">'locales'</span>, <span style="color: #2d9574;">'*'</span>,
        <span style="color: #2d9574;">'*.{rb,yml}'</span><span style="color: #bc6ec5;">)</span>.to_s<span style="color: #4f97d7;">]</span>
config.i18n.default_locale = :<span style="color: #2d9574;">"zh-CN"</span>
</pre>
</div>

<p>
按照 rails 风格，config/locales
就是放置语言包的地方，不建议更改。然后我们就可以利用这样的风格来管理语言包了。
</p>

<pre class="example">
+locales--
 |+zh-CN
  |default.yml
  |devise.yml
  |..
 |+en
  |default.yml
  |devise.yml
  |..
</pre>
</div>
</div>

<div id="outline-container-org9b75b59" class="outline-3">
<h3 id="org9b75b59"><span class="section-number-3">1.5</span> 配置 cancan</h3>
<div class="outline-text-3" id="text-1-5">
<pre class="example">
rails g cancan:ability
</pre>

<p>
配置 admin 可以干所有的事情，一般用户只能读取数据
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">app/models/ability.rb</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> user.has_role? <span style="color: #a45bad;">:admin</span>
  can <span style="color: #a45bad;">:manage</span>, <span style="color: #a45bad;">:all</span>
<span style="color: #4f97d7; font-weight: bold;">else</span>
  can <span style="color: #a45bad;">:read</span>, <span style="color: #a45bad;">:all</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dd40b9" class="outline-3">
<h3 id="org1dd40b9"><span class="section-number-3">1.6</span> 为 activeadmin 配置 cancan 权限</h3>
<div class="outline-text-3" id="text-1-6">
<p>
这个应该是最重要的部分
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">config/initialize/active_admin.rb</span>
config.authorization_adapter = <span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>::<span style="color: #ce537a; font-weight: bold;">CanCanAdapter</span>
config.cancan_ability_class = <span style="color: #2d9574;">"Ability"</span>
config.on_unauthorized_access = <span style="color: #a45bad;">:access_denied</span>
</pre>
</div>

<p>
配置完上面的内容以后
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">app/controller/application_controller.rb</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">access_denied</span><span style="color: #4f97d7;">(</span>exception<span style="color: #4f97d7;">)</span>
  redirect_to<span style="color: #4f97d7;">(</span>users_path, <span style="color: #a45bad;">alert:</span> exception.message<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">config/routes.rb</span>
root <span style="color: #a45bad;">to:</span> <span style="color: #2d9574;">'admin/dashboard#index'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a60c4b" class="outline-3">
<h3 id="org3a60c4b"><span class="section-number-3">1.7</span> 配置邮件服务器</h3>
<div class="outline-text-3" id="text-1-7">
<p>
在开发环境下，需要配置下列内容：
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">config/environments/development.rb:</span>
config.action_mailer.default_url_options = <span style="color: #4f97d7;">{</span> <span style="color: #a45bad;">host:</span> <span style="color: #2d9574;">'localhost'</span>, <span style="color: #a45bad;">port:</span> <span style="color: #a45bad;">3000</span> <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0adf0b" class="outline-3">
<h3 id="orgc0adf0b"><span class="section-number-3">1.8</span> 配置信息提示页面</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">app/views/layouts/application.html.erb</span>

&lt;<span style="color: #4f97d7;">p</span> <span style="color: #4f97d7; font-weight: bold;">class</span>=<span style="color: #2d9574;">"notice"</span>&gt;&lt;<span style="color: #2d9574;">%= notice %&gt;&lt;/p&gt;</span>
<span style="color: #2d9574;">&lt;p class="alert"</span>&gt;&lt;<span style="color: #2d9574;">%= alert %&gt;&lt;/p&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3b637c2" class="outline-3">
<h3 id="org3b637c2"><span class="section-number-3">1.9</span> 启动服务</h3>
<div class="outline-text-3" id="text-1-9">
<pre class="example">
rails s
</pre>

<p>
访问 <a href="http://localhost:3000/admin">http://localhost:3000/admin</a> , 分别利用不同的用户登陆，进入 User
菜单，可以看到对 admin 和非 admin
用户所呈现的菜单是不一样的。一般用户只能读取，而 admin
用户可以修改，增加，删除。由此，activeadmin 对权限的支持也异常漂亮。
</p>
</div>
</div>


<div id="outline-container-org82d73a8" class="outline-3">
<h3 id="org82d73a8"><span class="section-number-3">1.10</span> 如果要关闭用户登录验证功能，可以用：</h3>
<div class="outline-text-3" id="text-1-10">
<pre class="example">
# initializer/active_admin
config.current_user_method = false
config.authentication_method = false
</pre>
</div>
</div>

<div id="outline-container-orga024ab6" class="outline-3">
<h3 id="orga024ab6"><span class="section-number-3">1.11</span> Comment</h3>
<div class="outline-text-3" id="text-1-11">
<p>
因为不需要 comment(注解)这个功能，所以在 initializer 中的 active_admin
中关闭这个功能
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">For the entire application:</span>
<span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>.setup <span style="color: #4f97d7; font-weight: bold;">do</span> |config|
  config.comments = <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">For a namespace:</span>
<span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>.setup <span style="color: #4f97d7; font-weight: bold;">do</span> |config|
  config.namespace <span style="color: #a45bad;">:admin</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |admin|
    admin.comments = <span style="color: #a45bad;">false</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">For a given resource:</span>
<span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>.register <span style="color: #ce537a; font-weight: bold;">Post</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  config.comments = <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
