_org/_posts/dev/2018-11-22-rails-activeadmin.org
* Utility Navigation（导航）

在右上角有一些快速导航按钮，默认的有两个，一个是当前的 admin
用户，另外一个是登出按钮，我们可以增加导航按钮

#+BEGIN_SRC ruby
    ActiveAdmin.setup do |config|
      config.namespace :admin do |admin|
        admin.build_menu :utility_navigation do |menu|
          menu.add label: "ActiveAdmin.info", url: "http://www.activeadmin.info",
                                              html_options: { target: :blank }
          admin.add_current_user_to_menu  menu
          admin.add_logout_button_to_menu menu
        end
      end
    end
#+END_SRC

* 创建 Resources

添加一个 model，然后把 model 加入 active admin resources

#+BEGIN_EXAMPLE
    bin/rails generate model Post name:string title:string content:text
    # => app/model/post.rb
    bin/rails generate active_admin:resource Post
    # => app/admin/posts.rb
#+END_EXAMPLE

执行后会生成 app/admin/post.rb 文件

** permit_params

使用 permit_params 方法来定义哪些属性可以被修改,如果修改了没有被
permit_params 定义的属性，修改不会生效

#+BEGIN_SRC ruby
    ActiveAdmin.register Post do
      permit_params :title, :content, :publisher_id
    end
#+END_SRC

** 定义一个 Resource 中的 action

默认的，所有的 CRUD 的 actions
都可以操作，如果要禁用其中的某些操作，用如下定义：

#+BEGIN_SRC ruby
    ActiveAdmin.register Post do
      actions :all, except: [:update, :destroy]
    end
#+END_SRC

* 自定义 Menu

一个 resource 默认都会在全局导航栏上，如果要禁止一个 resource
出现在全局导航栏上，我们可以用：

#+BEGIN_EXAMPLE
    ActiveAdmin.register Post do
      # menu false
      # menu label: "自定义标题",priority: 1
    end
#+END_EXAMPLE

menu 有 4 个选项可以用：

- :label - 指定该 menu 的名称
- :parent - 指定一个顶级菜单
- :if - 指定一个条件
- :priority - 默认为 10，在全局导航栏上的位置

** 添加自定义的 menu

#+BEGIN_SRC ruby
    # config/initializers/active_admin.rb

    config.namespace :admin do |admin|
      admin.build_menu do |menu|
        menu.add label: "The Application", url: "/", priority: 0

        menu.add label: "Sites" do |sites|
          sites.add label: "Google",
                    url: "http://google.com",
                    html_options: { target: :blank }
          sites.add label: "Github",
                    url: "http://github.com"
        end
      end
    end
#+END_SRC

** 自定义 resource 的 index 页面

提供 4 中样式，Block，Blog，Grid，Table，一般我们用的是
table，也是默认的样式。这里只介绍 table。 默认的，index 页面会展示对应的
model 的所以字段，可供查看，修改，删除。 如果要自定义字段，可以用：

#+BEGIN_SRC ruby
    index do
      selectable_column
      column :title
      column "My custom name", :name
    end
#+END_SRC

这些自定的字段要被 index 包裹：

- selectable_column 显示勾选框，用于批量操作
- column 显示什么字段，该字段必须是 model
  的字段名，可以给这个字段另取一个别名

还可以根据条件设置特别的 row 样式，这个 some_style 样式放在
app/asset/stylesheets/active_admin.scss 中

#+BEGIN_SRC ruby
    index(row_class: ->item { 'some_style' if item.is_show }) do
    end
#+END_SRC

* 自定义 Actions

如果要给 resource 设置链接到查看，修改，删除这几个按钮，可以用 actions
方法

#+BEGIN_SRC ruby
    index do
      selectable_column
      column :title
      actions
    end
#+END_SRC

也可以增加自定的链接

#+BEGIN_SRC ruby
    index do
      selectable_column
      column :title
      actions do |post|
        item "Preview", admin_preview_post_path(post), class: "member_link"
      end
    end
#+END_SRC

获取重新设置链接

#+BEGIN_SRC ruby
    index do
      column :title
      actions defaults: false do |post|
        item "View", admin_post_path(post)
      end
    end
#+END_SRC

