_posts/dev/2018-11-22-rails-activeadmin.html

<div id="outline-container-org5cb4be4" class="outline-2">
<h2 id="org5cb4be4"><span class="section-number-2">2</span> Utility Navigation（导航）</h2>
<div class="outline-text-2" id="text-2">
<p>
在右上角有一些快速导航按钮，默认的有两个，一个是当前的 admin
用户，另外一个是登出按钮，我们可以增加导航按钮
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>.setup <span style="color: #4f97d7; font-weight: bold;">do</span> |config|
  config.namespace <span style="color: #a45bad;">:admin</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |admin|
    admin.build_menu <span style="color: #a45bad;">:utility_navigation</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |menu|
      menu.add <span style="color: #a45bad;">label:</span> <span style="color: #2d9574;">"ActiveAdmin.info"</span>, <span style="color: #a45bad;">url:</span> <span style="color: #2d9574;">"http://www.activeadmin.info"</span>,
                                          <span style="color: #a45bad;">html_options:</span> <span style="color: #4f97d7;">{</span> <span style="color: #a45bad;">target:</span> <span style="color: #a45bad;">:blank</span> <span style="color: #4f97d7;">}</span>
      admin.add_current_user_to_menu  menu
      admin.add_logout_button_to_menu menu
    <span style="color: #4f97d7; font-weight: bold;">end</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd21cf1a" class="outline-2">
<h2 id="orgd21cf1a"><span class="section-number-2">3</span> 创建 Resources</h2>
<div class="outline-text-2" id="text-3">
<p>
添加一个 model，然后把 model 加入 active admin resources
</p>

<pre class="example">
bin/rails generate model Post name:string title:string content:text
# =&gt; app/model/post.rb
bin/rails generate active_admin:resource Post
# =&gt; app/admin/posts.rb
</pre>

<p>
执行后会生成 app/admin/post.rb 文件
</p>
</div>

<div id="outline-container-orgfb6de50" class="outline-3">
<h3 id="orgfb6de50"><span class="section-number-3">3.1</span> permit_params</h3>
<div class="outline-text-3" id="text-3-1">
<p>
使用 permit_params 方法来定义哪些属性可以被修改,如果修改了没有被
permit_params 定义的属性，修改不会生效
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>.register <span style="color: #ce537a; font-weight: bold;">Post</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  permit_params <span style="color: #a45bad;">:title</span>, <span style="color: #a45bad;">:content</span>, <span style="color: #a45bad;">:publisher_id</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc668360" class="outline-3">
<h3 id="orgc668360"><span class="section-number-3">3.2</span> 定义一个 Resource 中的 action</h3>
<div class="outline-text-3" id="text-3-2">
<p>
默认的，所有的 CRUD 的 actions
都可以操作，如果要禁用其中的某些操作，用如下定义：
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>.register <span style="color: #ce537a; font-weight: bold;">Post</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  actions <span style="color: #a45bad;">:all</span>, <span style="color: #a45bad;">except:</span> <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">:update</span>, <span style="color: #a45bad;">:destroy</span><span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org536bf97" class="outline-2">
<h2 id="org536bf97"><span class="section-number-2">4</span> 自定义 Menu</h2>
<div class="outline-text-2" id="text-4">
<p>
一个 resource 默认都会在全局导航栏上，如果要禁止一个 resource
出现在全局导航栏上，我们可以用：
</p>

<pre class="example">
ActiveAdmin.register Post do
  # menu false
  # menu label: "自定义标题",priority: 1
end
</pre>

<p>
menu 有 4 个选项可以用：
</p>

<ul class="org-ul">
<li>:label - 指定该 menu 的名称</li>
<li>:parent - 指定一个顶级菜单</li>
<li>:if - 指定一个条件</li>
<li>:priority - 默认为 10，在全局导航栏上的位置</li>
</ul>
</div>

<div id="outline-container-org78a5c34" class="outline-3">
<h3 id="org78a5c34"><span class="section-number-3">4.1</span> 添加自定义的 menu</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">config/initializers/active_admin.rb</span>

config.namespace <span style="color: #a45bad;">:admin</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |admin|
  admin.build_menu <span style="color: #4f97d7; font-weight: bold;">do</span> |menu|
    menu.add <span style="color: #a45bad;">label:</span> <span style="color: #2d9574;">"The Application"</span>, <span style="color: #a45bad;">url:</span> <span style="color: #2d9574;">"/"</span>, <span style="color: #a45bad;">priority:</span> <span style="color: #a45bad;">0</span>

    menu.add <span style="color: #a45bad;">label:</span> <span style="color: #2d9574;">"Sites"</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |sites|
      sites.add <span style="color: #a45bad;">label:</span> <span style="color: #2d9574;">"Google"</span>,
                <span style="color: #a45bad;">url:</span> <span style="color: #2d9574;">"http://google.com"</span>,
                <span style="color: #a45bad;">html_options:</span> <span style="color: #4f97d7;">{</span> <span style="color: #a45bad;">target:</span> <span style="color: #a45bad;">:blank</span> <span style="color: #4f97d7;">}</span>
      sites.add <span style="color: #a45bad;">label:</span> <span style="color: #2d9574;">"Github"</span>,
                <span style="color: #a45bad;">url:</span> <span style="color: #2d9574;">"http://github.com"</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d57eca" class="outline-3">
<h3 id="org1d57eca"><span class="section-number-3">4.2</span> 自定义 resource 的 index 页面</h3>
<div class="outline-text-3" id="text-4-2">
<p>
提供 4 中样式，Block，Blog，Grid，Table，一般我们用的是
table，也是默认的样式。这里只介绍 table。 默认的，index 页面会展示对应的
model 的所以字段，可供查看，修改，删除。 如果要自定义字段，可以用：
</p>

<div class="org-src-container">
<pre class="src src-ruby">index <span style="color: #4f97d7; font-weight: bold;">do</span>
  selectable_column
  column <span style="color: #a45bad;">:title</span>
  column <span style="color: #2d9574;">"My custom name"</span>, <span style="color: #a45bad;">:name</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
这些自定的字段要被 index 包裹：
</p>

<ul class="org-ul">
<li>selectable_column 显示勾选框，用于批量操作</li>
<li>column 显示什么字段，该字段必须是 model
的字段名，可以给这个字段另取一个别名</li>
</ul>

<p>
还可以根据条件设置特别的 row 样式，这个 some_style 样式放在
app/asset/stylesheets/active_admin.scss 中
</p>

<div class="org-src-container">
<pre class="src src-ruby">index<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">row_class:</span> -&gt;item <span style="color: #bc6ec5;">{</span> <span style="color: #2d9574;">'some_style'</span> <span style="color: #4f97d7; font-weight: bold;">if</span> item.is_show <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge75078c" class="outline-2">
<h2 id="orge75078c"><span class="section-number-2">5</span> 自定义 Actions</h2>
<div class="outline-text-2" id="text-5">
<p>
如果要给 resource 设置链接到查看，修改，删除这几个按钮，可以用 actions
方法
</p>

<div class="org-src-container">
<pre class="src src-ruby">index <span style="color: #4f97d7; font-weight: bold;">do</span>
  selectable_column
  column <span style="color: #a45bad;">:title</span>
  actions
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
也可以增加自定的链接
</p>

<div class="org-src-container">
<pre class="src src-ruby">index <span style="color: #4f97d7; font-weight: bold;">do</span>
  selectable_column
  column <span style="color: #a45bad;">:title</span>
  actions <span style="color: #4f97d7; font-weight: bold;">do</span> |post|
    item <span style="color: #2d9574;">"Preview"</span>, admin_preview_post_path<span style="color: #4f97d7;">(</span>post<span style="color: #4f97d7;">)</span>, <span style="color: #4f97d7; font-weight: bold;">class</span>: <span style="color: #2d9574;">"member_link"</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
获取重新设置链接
</p>

<div class="org-src-container">
<pre class="src src-ruby">index <span style="color: #4f97d7; font-weight: bold;">do</span>
  column <span style="color: #a45bad;">:title</span>
  actions <span style="color: #a45bad;">defaults:</span> <span style="color: #a45bad;">false</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |post|
    item <span style="color: #2d9574;">"View"</span>, admin_post_path<span style="color: #4f97d7;">(</span>post<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
