_org/_posts/dev/2018-11-22-rails-activeadmin.org
* Form(model 的创建或者修改表单)

默认的表单是展示所有的字段

#+BEGIN_SRC ruby
    form do |f|
      f.semantic_errors # shows errors on :base
      f.inputs          # builds an input field for every attribute
      f.actions         # adds the 'Submit' and 'Cancel' buttons
    end
#+END_SRC

示例：

#+BEGIN_SRC ruby
    form title: 'A custom title' do |f|
        inputs 'Details' do
          input :part1
          input :part2, label: "Publish Post At"
          li "Created at #{f.object.created_at}" unless f.object.new_record?
          input :part3
        end
        panel 'Markup' do
          "The following can be used in the content below..."
        end
        inputs 'Content', :part3
        para "Press cancel to return to the list without saving."
        input :created_at, as: :datepicker,
                datepicker_options: {
                    min_date: "2013-10-8",
                    max_date: "+3D"
                }
        actions
      end
#+END_SRC

* 增加 action 的按钮

link_to path 中的 path 指定的方式是

1. 命名空间_model 的复数形式_path
2. controller 名称_方法名_path

#+BEGIN_SRC ruby
    action_item only: :index do
      link_to '刷新疑似状态', admin_app_oral_memories_path, notice: "刷新成功"
    end
#+END_SRC

增加 batch 操作按钮

#+BEGIN_SRC ruby
    batch_action "封禁" do |selection|
    end
#+END_SRC

Index Filter 过滤器

#+BEGIN_SRC ruby
    filter :name, label: "name"
#+END_SRC

一般的，通过上面这个形式就好了，activeadmin 会自动判断其类型。

或者有另个情况，有个关联表。

#+BEGIN_SRC ruby
    filter :location_id, label: "地点", as: :select, collection: AppExamLocation.all.map{|x| [x.location,x.id]}
#+END_SRC

通过:as 可以指定类型，提供这一下这几种类型

#+BEGIN_SRC ruby
    :string - A drop down for selecting “Contains”, “Equals”, “Starts with”, “Ends with” and an input for a value.
    :date_range - A start and end date field with calendar inputs
    :numeric - A drop down for selecting “Equal To”, “Greater Than” or “Less Than” and an input for a value.
    :select - A drop down which filters based on a selected item in a collection or all.
    :check_boxes - A list of check boxes users can turn on and off to filter
#+END_SRC

* 项目汉化

** ActiveAdmin 汉化

** 第一步：局部汉化

#+BEGIN_SRC ruby
    ActiveAdmin.register AdminUser do
      menu :label => "用户管理"

      index do
        column "邮箱",:email
        column "最近登录",:current_sign_in_at
        column "上次登录",:last_sign_in_at
        column "登录次数",:sign_in_count
        default_actions
      end

      filter :email, :label=>"邮箱"

      form do |f|
        f.inputs "用户资料" do
          f.input :email ,:label=>"邮箱"
          f.input :password ,:label=>"密码"
          f.input :password_confirmation ,:label=>"重复密码"
        end
        f.actions
      end

      # 右侧帮助
      sidebar :help,:only => :index do
        "如果您在使用后台管理时遇到问题，请联系 robot.zhu@icitymobile.com"
      end
    end
#+END_SRC

按上述设置后，页面部分内容将变成中文。

- menu 菜单栏文字
- index column 列表中某列
- filter label 筛选器标签
- form inputs 表单的标题
- form input label 单个文本输入框前的标签

这个时候看，整个框架还是英文的。

** 第二步：框架汉化

导入 ActiveAdmin 提供的语言文件。根据需要选择。简体中文就选择
zh-CN.yml。

- 地址：https://github.com/activeadmin/activeadmin/tree/master/config/locales
- 中文：https://github.com/activeadmin/activeadmin/blob/master/config/locales/zh-CN.yml

将 zh-CN.yml 复制到自己的 config/locales/目录下。

** 第三步：修改配置

修改 config/application.rb 文件，添加下面两行。

#+BEGIN_SRC ruby
    config.i18n.available_locales = [:"zh-CN", :en]
    config.i18n.default_locale = :"zh-CN"
#+END_SRC

重启 Rails Server。

整个框架就变成中文了。

