_posts/dev/2018-11-22-rails-activeadmin.html

<div id="outline-container-org51be820" class="outline-2">
<h2 id="org51be820"><span class="section-number-2">6</span> Form(model 的创建或者修改表单)</h2>
<div class="outline-text-2" id="text-6">
<p>
默认的表单是展示所有的字段
</p>

<div class="org-src-container">
<pre class="src src-ruby">form <span style="color: #4f97d7; font-weight: bold;">do</span> |f|
  f.semantic_errors <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">shows errors on :base</span>
  f.inputs          <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">builds an input field for every attribute</span>
  f.actions         <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">adds the 'Submit' and 'Cancel' buttons</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
示例：
</p>

<div class="org-src-container">
<pre class="src src-ruby">form <span style="color: #a45bad;">title:</span> <span style="color: #2d9574;">'A custom title'</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |f|
    inputs <span style="color: #2d9574;">'Details'</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      input <span style="color: #a45bad;">:part1</span>
      input <span style="color: #a45bad;">:part2</span>, <span style="color: #a45bad;">label:</span> <span style="color: #2d9574;">"Publish Post At"</span>
      li <span style="color: #2d9574;">"Created at </span><span style="color: #7590db;">#{f.object.created_at}</span><span style="color: #2d9574;">"</span> <span style="color: #4f97d7; font-weight: bold;">unless</span> f.object.new_record?
      input <span style="color: #a45bad;">:part3</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    panel <span style="color: #2d9574;">'Markup'</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      <span style="color: #2d9574;">"The following can be used in the content below..."</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    inputs <span style="color: #2d9574;">'Content'</span>, <span style="color: #a45bad;">:part3</span>
    para <span style="color: #2d9574;">"Press cancel to return to the list without saving."</span>
    input <span style="color: #a45bad;">:created_at</span>, <span style="color: #a45bad;">as:</span> <span style="color: #a45bad;">:datepicker</span>,
            <span style="color: #a45bad;">datepicker_options:</span> <span style="color: #4f97d7;">{</span>
                <span style="color: #a45bad;">min_date:</span> <span style="color: #2d9574;">"2013-10-8"</span>,
                <span style="color: #a45bad;">max_date:</span> <span style="color: #2d9574;">"+3D"</span>
            <span style="color: #4f97d7;">}</span>
    actions
  <span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfacfa0" class="outline-2">
<h2 id="orgbfacfa0"><span class="section-number-2">7</span> 增加 action 的按钮</h2>
<div class="outline-text-2" id="text-7">
<p>
link_to path 中的 path 指定的方式是
</p>

<ol class="org-ol">
<li>命名空间_model 的复数形式_path</li>
<li>controller 名称_方法名_path</li>
</ol>

<div class="org-src-container">
<pre class="src src-ruby">action_item <span style="color: #a45bad;">only:</span> <span style="color: #a45bad;">:index</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  link_to <span style="color: #2d9574;">'&#21047;&#26032;&#30097;&#20284;&#29366;&#24577;'</span>, admin_app_oral_memories_path, <span style="color: #a45bad;">notice:</span> <span style="color: #2d9574;">"&#21047;&#26032;&#25104;&#21151;"</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
增加 batch 操作按钮
</p>

<div class="org-src-container">
<pre class="src src-ruby">batch_action <span style="color: #2d9574;">"&#23553;&#31105;"</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |selection|
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
Index Filter 过滤器
</p>

<div class="org-src-container">
<pre class="src src-ruby">filter <span style="color: #a45bad;">:name</span>, <span style="color: #a45bad;">label:</span> <span style="color: #2d9574;">"name"</span>
</pre>
</div>

<p>
一般的，通过上面这个形式就好了，activeadmin 会自动判断其类型。
</p>

<p>
或者有另个情况，有个关联表。
</p>

<div class="org-src-container">
<pre class="src src-ruby">filter <span style="color: #a45bad;">:location_id</span>, <span style="color: #a45bad;">label:</span> <span style="color: #2d9574;">"&#22320;&#28857;"</span>, <span style="color: #a45bad;">as:</span> <span style="color: #a45bad;">:select</span>, <span style="color: #a45bad;">collection:</span> <span style="color: #ce537a; font-weight: bold;">AppExamLocation</span>.all.map<span style="color: #4f97d7;">{</span>|x| <span style="color: #bc6ec5;">[</span>x.location,x.id<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
通过:as 可以指定类型，提供这一下这几种类型
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a45bad;">:string</span> - <span style="color: #ce537a; font-weight: bold;">A</span> drop down <span style="color: #4f97d7; font-weight: bold;">for</span> selecting &#8220;<span style="color: #ce537a; font-weight: bold;">Contains</span>&#8221;, &#8220;<span style="color: #ce537a; font-weight: bold;">Equals</span>&#8221;, &#8220;<span style="color: #ce537a; font-weight: bold;">Starts</span> with&#8221;, &#8220;<span style="color: #ce537a; font-weight: bold;">Ends</span> with&#8221; <span style="color: #4f97d7; font-weight: bold;">and</span> an input <span style="color: #4f97d7; font-weight: bold;">for</span> a value.
<span style="color: #a45bad;">:date_range</span> - <span style="color: #ce537a; font-weight: bold;">A</span> start <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #4f97d7; font-weight: bold;">end</span> date field with calendar inputs
<span style="color: #a45bad;">:numeric</span> - <span style="color: #ce537a; font-weight: bold;">A</span> drop down <span style="color: #4f97d7; font-weight: bold;">for</span> selecting &#8220;<span style="color: #ce537a; font-weight: bold;">Equal</span> <span style="color: #ce537a; font-weight: bold;">To</span>&#8221;, &#8220;<span style="color: #ce537a; font-weight: bold;">Greater</span> <span style="color: #ce537a; font-weight: bold;">Than</span>&#8221; <span style="color: #4f97d7; font-weight: bold;">or</span> &#8220;<span style="color: #ce537a; font-weight: bold;">Less</span> <span style="color: #ce537a; font-weight: bold;">Than</span>&#8221; <span style="color: #4f97d7; font-weight: bold;">and</span> an input <span style="color: #4f97d7; font-weight: bold;">for</span> a value.
<span style="color: #a45bad;">:select</span> - <span style="color: #ce537a; font-weight: bold;">A</span> drop down which filters based on a selected item <span style="color: #4f97d7; font-weight: bold;">in</span> a collection <span style="color: #4f97d7; font-weight: bold;">or</span> all.
<span style="color: #a45bad;">:check_boxes</span> - <span style="color: #ce537a; font-weight: bold;">A</span> list of check boxes users can turn on <span style="color: #4f97d7; font-weight: bold;">and</span> off to filter
</pre>
</div>
</div>
</div>

<div id="outline-container-org87fc17a" class="outline-2">
<h2 id="org87fc17a"><span class="section-number-2">8</span> 项目汉化</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org3ac84c0" class="outline-3">
<h3 id="org3ac84c0"><span class="section-number-3">8.1</span> ActiveAdmin 汉化</h3>
</div>

<div id="outline-container-org2a77ccd" class="outline-3">
<h3 id="org2a77ccd"><span class="section-number-3">8.2</span> 第一步：局部汉化</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>.register <span style="color: #ce537a; font-weight: bold;">AdminUser</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  menu <span style="color: #a45bad;">:label</span> =&gt; <span style="color: #2d9574;">"&#29992;&#25143;&#31649;&#29702;"</span>

  index <span style="color: #4f97d7; font-weight: bold;">do</span>
    column <span style="color: #2d9574;">"&#37038;&#31665;"</span>,<span style="color: #a45bad;">:email</span>
    column <span style="color: #2d9574;">"&#26368;&#36817;&#30331;&#24405;"</span>,<span style="color: #a45bad;">:current_sign_in_at</span>
    column <span style="color: #2d9574;">"&#19978;&#27425;&#30331;&#24405;"</span>,<span style="color: #a45bad;">:last_sign_in_at</span>
    column <span style="color: #2d9574;">"&#30331;&#24405;&#27425;&#25968;"</span>,<span style="color: #a45bad;">:sign_in_count</span>
    default_actions
  <span style="color: #4f97d7; font-weight: bold;">end</span>

  filter <span style="color: #a45bad;">:email</span>, <span style="color: #a45bad;">:label</span>=&gt;<span style="color: #2d9574;">"&#37038;&#31665;"</span>

  form <span style="color: #4f97d7; font-weight: bold;">do</span> |f|
    f.inputs <span style="color: #2d9574;">"&#29992;&#25143;&#36164;&#26009;"</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
      f.input <span style="color: #a45bad;">:email</span> ,<span style="color: #a45bad;">:label</span>=&gt;<span style="color: #2d9574;">"&#37038;&#31665;"</span>
      f.input <span style="color: #a45bad;">:password</span> ,<span style="color: #a45bad;">:label</span>=&gt;<span style="color: #2d9574;">"&#23494;&#30721;"</span>
      f.input <span style="color: #a45bad;">:password_confirmation</span> ,<span style="color: #a45bad;">:label</span>=&gt;<span style="color: #2d9574;">"&#37325;&#22797;&#23494;&#30721;"</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    f.actions
  <span style="color: #4f97d7; font-weight: bold;">end</span>

  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21491;&#20391;&#24110;&#21161;</span>
  sidebar <span style="color: #a45bad;">:help</span>,<span style="color: #a45bad;">:only</span> =&gt; <span style="color: #a45bad;">:index</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #2d9574;">"&#22914;&#26524;&#24744;&#22312;&#20351;&#29992;&#21518;&#21488;&#31649;&#29702;&#26102;&#36935;&#21040;&#38382;&#39064;&#65292;&#35831;&#32852;&#31995; robot.zhu@icitymobile.com"</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
按上述设置后，页面部分内容将变成中文。
</p>

<ul class="org-ul">
<li>menu 菜单栏文字</li>
<li>index column 列表中某列</li>
<li>filter label 筛选器标签</li>
<li>form inputs 表单的标题</li>
<li>form input label 单个文本输入框前的标签</li>
</ul>

<p>
这个时候看，整个框架还是英文的。
</p>
</div>
</div>

<div id="outline-container-org41dbcb8" class="outline-3">
<h3 id="org41dbcb8"><span class="section-number-3">8.3</span> 第二步：框架汉化</h3>
<div class="outline-text-3" id="text-8-3">
<p>
导入 ActiveAdmin 提供的语言文件。根据需要选择。简体中文就选择
zh-CN.yml。
</p>

<ul class="org-ul">
<li>地址：<a href="https://github.com/activeadmin/activeadmin/tree/master/config/locales">https://github.com/activeadmin/activeadmin/tree/master/config/locales</a></li>
<li>中文：<a href="https://github.com/activeadmin/activeadmin/blob/master/config/locales/zh-CN.yml">https://github.com/activeadmin/activeadmin/blob/master/config/locales/zh-CN.yml</a></li>
</ul>

<p>
将 zh-CN.yml 复制到自己的 config/locales/目录下。
</p>
</div>
</div>

<div id="outline-container-orgeec5344" class="outline-3">
<h3 id="orgeec5344"><span class="section-number-3">8.4</span> 第三步：修改配置</h3>
<div class="outline-text-3" id="text-8-4">
<p>
修改 config/application.rb 文件，添加下面两行。
</p>

<div class="org-src-container">
<pre class="src src-ruby">config.i18n.available_locales = <span style="color: #4f97d7;">[</span>:<span style="color: #2d9574;">"zh-CN"</span>, <span style="color: #a45bad;">:en</span><span style="color: #4f97d7;">]</span>
config.i18n.default_locale = :<span style="color: #2d9574;">"zh-CN"</span>
</pre>
</div>

<p>
重启 Rails Server。
</p>

<p>
整个框架就变成中文了。
</p>
</div>
</div>
