_org/_posts/dev/2018-11-22-rails-activeadmin.org
** Model 国际化

实际上面这么做之后，还有少量地方仍然是英文。
比如：导航栏上的模块名称（Posts），右侧的"新建 Post"按钮。

我们肯定希望"Posts"显示为"博文"，"新建 Post"显示为"新建博文"。

这个时候需要在语言文件 zh-CN.yml 里加上 models 的国际化。

#+BEGIN_EXAMPLE
    activerecord:
      models:
        user: '用户'
        post: '博文'
        organization: '机构'
#+END_EXAMPLE

** Device 国际化

下载汉化包 devise.zh-CN.yml，并复制到自己的 config/locales/目录下。
下载地址：https://github.com/plataformatec/devise/wiki/I18n

** 错误列表

错误信息：

#+BEGIN_SRC ruby
    ActionView::Template::Error (translation missing: zh-CN.time.formats.long):
        1: insert_tag renderer_for(:index)
      app/admin/admin_user.rb:6:in `block (2 levels) in <top (required)>'
#+END_SRC

解决办法

引入 Rails 的语言文件。复制内容至 zh-CN.yml 文件中。

- 地址：https://github.com/tsechingho/rails-i18n/tree/master/rails/locale
- 中文：https://github.com/tsechingho/rails-i18n/blob/master/rails/locale/zh-CN.yml

* ActiveAdmin 更新

你可以键入如下命令进行对它的升级

#+BEGIN_EXAMPLE
    rails generate active_admin:assets
#+END_EXAMPLE

如果提示：uninitialized constant Admin::DashboardController
这个时候，需要 dashboard
view（app/admin/dashboards.rb）和初始化的时候一样。

