_posts/dev/2018-11-22-rails-activeadmin.html

<div id="outline-container-orge988c18" class="outline-3">
<h3 id="orge988c18"><span class="section-number-3">8.5</span> Model 国际化</h3>
<div class="outline-text-3" id="text-8-5">
<p>
实际上面这么做之后，还有少量地方仍然是英文。
比如：导航栏上的模块名称（Posts），右侧的"新建 Post"按钮。
</p>

<p>
我们肯定希望"Posts"显示为"博文"，"新建 Post"显示为"新建博文"。
</p>

<p>
这个时候需要在语言文件 zh-CN.yml 里加上 models 的国际化。
</p>

<pre class="example">
activerecord:
  models:
    user: '用户'
    post: '博文'
    organization: '机构'
</pre>
</div>
</div>

<div id="outline-container-org67f475d" class="outline-3">
<h3 id="org67f475d"><span class="section-number-3">8.6</span> Device 国际化</h3>
<div class="outline-text-3" id="text-8-6">
<p>
下载汉化包 devise.zh-CN.yml，并复制到自己的 config/locales/目录下。
下载地址：<a href="https://github.com/plataformatec/devise/wiki/I18n">https://github.com/plataformatec/devise/wiki/I18n</a>
</p>
</div>
</div>

<div id="outline-container-org0160c80" class="outline-3">
<h3 id="org0160c80"><span class="section-number-3">8.7</span> 错误列表</h3>
<div class="outline-text-3" id="text-8-7">
<p>
错误信息：
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #ce537a; font-weight: bold;">ActionView</span>::<span style="color: #ce537a; font-weight: bold;">Template</span>::<span style="color: #ce537a; font-weight: bold;">Error</span> <span style="color: #4f97d7;">(</span>translation <span style="color: #a45bad;">missing:</span> zh-<span style="color: #ce537a; font-weight: bold;">CN</span>.time.formats.long<span style="color: #4f97d7;">)</span>:
    <span style="color: #a45bad;">1</span>: insert_tag renderer_for<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">:index</span><span style="color: #4f97d7;">)</span>
  app/admin/admin_user.rb:<span style="color: #a45bad;">6</span>:in <span style="color: #2d9574;">`block (2 levels) in &lt;top (required)&gt;'</span>
</pre>
</div>

<p>
解决办法
</p>

<p>
引入 Rails 的语言文件。复制内容至 zh-CN.yml 文件中。
</p>

<ul class="org-ul">
<li>地址：<a href="https://github.com/tsechingho/rails-i18n/tree/master/rails/locale">https://github.com/tsechingho/rails-i18n/tree/master/rails/locale</a></li>
<li>中文：<a href="https://github.com/tsechingho/rails-i18n/blob/master/rails/locale/zh-CN.yml">https://github.com/tsechingho/rails-i18n/blob/master/rails/locale/zh-CN.yml</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga75664c" class="outline-2">
<h2 id="orga75664c"><span class="section-number-2">9</span> ActiveAdmin 更新</h2>
<div class="outline-text-2" id="text-9">
<p>
你可以键入如下命令进行对它的升级
</p>

<pre class="example">
rails generate active_admin:assets
</pre>

<p>
如果提示：uninitialized constant Admin::DashboardController
这个时候，需要 dashboard
view（app/admin/dashboards.rb）和初始化的时候一样。
</p>
</div>
</div>
