_posts/dev/2018-11-22-rails-activeadmin.html

<div id="outline-container-orgb2b6c82" class="outline-2">
<h2 id="orgb2b6c82"><span class="section-number-2">10</span> Rails Activeadmin 界面构成方法解析</h2>
<div class="outline-text-2" id="text-10">
<p>
以一个 PMS
系统中的供应商界面的功能来做例子，并没有将界面与后台代码解偶，而是绑定在了一起。controller
是这个文件，view 也是这个界面，只有 model 是另外的文件，这是 rails
的要求。该界面数据和数据库的一张表，或者说一个 model
相对应。一个界面就和一张数据表绑定，非绑定数据界面另放 view 中
render。理解这一点才能更好的理解功能的实现。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">supplier.rb &#25991;&#20214;&#65306;</span>
<span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>.register <span style="color: #ce537a; font-weight: bold;">Supplier</span> <span style="color: #4f97d7; font-weight: bold;">do</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">permit_params:&#20801;&#35768;&#25968;&#25454;&#24211;&#20256;&#21040;&#30028;&#38754;&#30340;&#21442;&#25968;</span>
  permit_params <span style="color: #a45bad;">:supplier_code</span>, <span style="color: #a45bad;">:supplier_type</span>, <span style="color: #a45bad;">:supplier_name</span>, <span style="color: #a45bad;">:supplier_simple</span>, <span style="color: #a45bad;">:company_address</span>, <span style="color: #a45bad;">:company_tel</span>, <span style="color: #a45bad;">:company_fax</span>, <span style="color: #a45bad;">:supplier_status</span>, <span style="color: #a45bad;">:company_account</span>,
                <span style="color: #a45bad;">:account_name</span>, <span style="color: #a45bad;">:company_tax</span>, <span style="color: #a45bad;">:supplier_order</span>, <span style="color: #a45bad;">:contact_count</span>, <span style="color: #a45bad;">:attachment_count</span>, <span style="color: #a45bad;">:material_count</span>, <span style="color: #a45bad;">:remark</span>, <span style="color: #a45bad;">:operator_id</span>, <span style="color: #a45bad;">:payment_term</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20998;&#39029;&#24320;&#21551;&#65292;&#21644;&#27599;&#39029;&#25968;&#25454;&#37327;</span>
  config.paginate = <span style="color: #a45bad;">true</span>
  config.per_page = <span style="color: #a45bad;">20</span>
  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#40664;&#35748;&#25490;&#24207;</span>
  config.sort_order = <span style="color: #2d9574;">'supplier_order'</span>

  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#31105;&#29992;&#21151;&#33021;</span>
  config.filters = <span style="color: #a45bad;">false</span>
  config.batch_actions = <span style="color: #a45bad;">false</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#32465;&#23450;&#30340;&#25968;&#25454;&#34920;&#30340;&#20449;&#24687;&#23637;&#31034;,&#23558;&#23637;&#31034;&#30340;&#20449;&#24687;&#20570;&#22788;&#29702;&#65292;&#22914;&#26524;&#19981;&#20889;&#36825;&#27573;&#65292;&#25968;&#25454;&#34920;&#20013;&#30340;&#25968;&#25454;&#20173;&#28982;&#20250;&#26174;&#31034;&#65292;&#12288;&#20294;&#26159;&#20250;&#26174;&#31034;&#25152;&#26377;&#23383;&#27573;&#65292;&#24182;&#19988;&#26174;&#31034;&#30340;&#21015;&#21517;&#20026;&#25968;&#25454;&#34920;&#30340;&#23383;&#27573;&#21517;&#65292;&#20174;&#32593;&#39029;&#26174;&#31034;&#30340;&#35282;&#24230;&#26469;&#35828;&#24182;&#19981;&#32654;&#35266;</span>
index <span style="color: #a45bad;">:title</span> =&gt; <span style="color: #2d9574;">'&#20379;&#24212;&#21830;&#21015;&#34920;'</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    selectable_column
    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">id_column</span>
    column <span style="color: #2d9574;">"&#32534;&#30721;"</span>, <span style="color: #a45bad;">:supplier_code</span>
    column <span style="color: #2d9574;">"&#31867;&#21035;"</span>, <span style="color: #a45bad;">:supplier_type_name</span>
    column <span style="color: #2d9574;">"&#21517;&#31216;"</span>, <span style="color: #a45bad;">:supplier_name</span>
    column <span style="color: #2d9574;">"&#20844;&#21496;&#22320;&#22336;"</span>, <span style="color: #a45bad;">:company_address</span>
    column <span style="color: #2d9574;">"&#29366;&#24577;"</span>, <span style="color: #a45bad;">:supplier_status_name</span>
    column <span style="color: #2d9574;">"&#22791;&#27880;"</span>, <span style="color: #a45bad;">:remark</span>
    column <span style="color: #2d9574;">"&#23646;&#24615;"</span> <span style="color: #4f97d7; font-weight: bold;">do</span> |f|

      <span style="color: #4f97d7; font-weight: bold;">if</span> f.attachment_count &gt; <span style="color: #a45bad;">0</span>
        span  <span style="color: #4f97d7; font-weight: bold;">do</span>
          image_tag <span style="color: #2d9574;">"/assets/icons/address.png"</span>, <span style="color: #a45bad;">height:</span> <span style="color: #2d9574;">'20'</span>, <span style="color: #a45bad;">width:</span> <span style="color: #2d9574;">'20'</span>, <span style="color: #a45bad;">title:</span> <span style="color: #2d9574;">"&#26377;&#38468;&#20214;"</span>
        <span style="color: #4f97d7; font-weight: bold;">end</span>
      <span style="color: #4f97d7; font-weight: bold;">end</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    actions
  <span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#30028;&#38754;&#26041;&#27861;&#65292;&#22914;&#38750;&#32465;&#23450;&#25968;&#25454;&#30028;&#38754;&#30340;&#21518;&#21488;&#26041;&#27861;&#30340;</span>
 collection_action <span style="color: #a45bad;">:get_users</span>, <span style="color: #a45bad;">:method</span> =&gt; <span style="color: #a45bad;">:post</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    supplier_id = params<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">:id</span><span style="color: #4f97d7;">]</span>
    render <span style="color: #a45bad;">json:</span> <span style="color: #ce537a; font-weight: bold;">SupplierContact</span>.format_contact_data<span style="color: #4f97d7;">(</span>supplier_id<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>

  collection_action <span style="color: #a45bad;">:save_contact</span>, <span style="color: #a45bad;">:method</span> =&gt; <span style="color: #a45bad;">:post</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    render <span style="color: #a45bad;">json:</span> <span style="color: #ce537a; font-weight: bold;">SupplierContact</span>.save_contact_data<span style="color: #4f97d7;">(</span>params<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>

&#65283;form &#34920;&#21333;&#26174;&#31034;&#12288;&#21644; index &#19968;&#26679;&#26159;&#19968;&#31181;&#25968;&#25454;&#23637;&#31034;&#30340;&#26041;&#24335;&#65292;&#20854;&#20182;&#30340;&#36824;&#26377; grid,<span style="color: #ce537a; font-weight: bold;">Table</span>,blog,<span style="color: #ce537a; font-weight: bold;">Blocks</span>
&#65283;
form <span style="color: #4f97d7; font-weight: bold;">do</span> |f|
    f.inputs <span style="color: #2d9574;">"&#20379;&#24212;&#21830;&#20449;&#24687;"</span> <span style="color: #4f97d7; font-weight: bold;">do</span>

      <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21482;&#26377;&#26032;&#24314;&#26102;&#25165;&#26356;&#26032;</span>
      <span style="color: #4f97d7; font-weight: bold;">if</span> resource.supplier_code.present?
        supplier_code = resource.supplier_code
      <span style="color: #4f97d7; font-weight: bold;">else</span>
        supplier_code = <span style="color: #ce537a; font-weight: bold;">Base</span>.get_model_code<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'GYS'</span>, <span style="color: #a45bad;">4</span>, <span style="color: #2d9574;">'supplier'</span><span style="color: #4f97d7;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">end</span>

      f.input <span style="color: #a45bad;">:supplier_code</span>, <span style="color: #a45bad;">:hint</span> =&gt; <span style="color: #2d9574;">"&#20379;&#24212;&#21830;&#21807;&#19968;&#32534;&#21495;"</span>, <span style="color: #a45bad;">:input_html</span> =&gt; <span style="color: #4f97d7;">{</span> <span style="color: #a45bad;">:value</span> =&gt; supplier_code, <span style="color: #a45bad;">:readonly</span> =&gt; <span style="color: #a45bad;">true</span><span style="color: #4f97d7;">}</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20379;&#24212;&#21830;&#32534;&#21495;"</span>

      f.input <span style="color: #a45bad;">:supplier_name</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20379;&#24212;&#21830;&#20840;&#31216;"</span>, <span style="color: #a45bad;">:required</span> =&gt; <span style="color: #a45bad;">true</span>
      f.input <span style="color: #a45bad;">:supplier_simple</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#31616;&#31216;"</span>
      f.input <span style="color: #a45bad;">:supplier_type</span>, <span style="color: #a45bad;">:as</span> =&gt; <span style="color: #a45bad;">:select</span>, <span style="color: #a45bad;">:collection</span> =&gt;  resource.supplier_type_ary, <span style="color: #a45bad;">:include_blank</span> =&gt; <span style="color: #a45bad;">false</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20379;&#24212;&#21830;&#31867;&#21035;"</span>
      f.input <span style="color: #a45bad;">:supplier_status</span>, <span style="color: #a45bad;">:as</span> =&gt; <span style="color: #a45bad;">:select</span>, <span style="color: #a45bad;">:collection</span> =&gt;  resource.supplier_status_ary, <span style="color: #a45bad;">:include_blank</span> =&gt; <span style="color: #a45bad;">false</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20379;&#24212;&#21830;&#29366;&#24577;"</span>
      f.input <span style="color: #a45bad;">:company_address</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20844;&#21496;&#22320;&#22336;"</span>
      f.input <span style="color: #a45bad;">:company_tel</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20844;&#21496;&#24231;&#26426;"</span>
      f.input <span style="color: #a45bad;">:company_fax</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20844;&#21496;&#20256;&#30495;"</span>
      f.input <span style="color: #a45bad;">:company_account</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20844;&#21496;&#36134;&#25143;"</span>
      f.input <span style="color: #a45bad;">:account_name</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#36134;&#25143;&#21517;&#31216;"</span>
      f.input <span style="color: #a45bad;">:company_tax</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#31246;&#21495;"</span>
      f.input <span style="color: #a45bad;">:payment_term</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#20184;&#27454;&#21608;&#26399;"</span>
      f.input <span style="color: #a45bad;">:remark</span>, <span style="color: #a45bad;">:input_html</span> =&gt; <span style="color: #4f97d7;">{</span> <span style="color: #a45bad;">:rows</span> =&gt; <span style="color: #2d9574;">"5"</span><span style="color: #4f97d7;">}</span>, <span style="color: #a45bad;">:label</span>=&gt; <span style="color: #2d9574;">"&#22791;&#27880;"</span>
      f.input <span style="color: #a45bad;">:operator_id</span>, <span style="color: #a45bad;">:as</span> =&gt; <span style="color: #a45bad;">:hidden</span>, <span style="color: #a45bad;">:input_html</span> =&gt; <span style="color: #4f97d7;">{</span><span style="color: #a45bad;">:value</span> =&gt; current_active_admin_user.id<span style="color: #4f97d7;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    f.actions
  <span style="color: #4f97d7; font-weight: bold;">end</span>


 <span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
