_org/_posts/dev/2018-11-22-rails-activeadmin.org
* 增加全局错误信息提示

** 定义错误

#+BEGIN_SRC ruby
    class User < ActiveRecord::Base
      before_destroy :before_destroy_check

      def before_destroy_check
        errors.add(:base, '不能删除管理员') if id < 2
        throw :abort if errors.anyblank?
      end
    end
#+END_SRC

** 显示错误

#+BEGIN_SRC ruby
    form do |f|
      f.semantic_errors *f.object.errors.keys
      # ...
    end
#+END_SRC

或者直接打补丁

#+BEGIN_SRC ruby
    config/initializers/active_admin_patches.rb.

    class ActiveAdmin::ResourceController
      def check_model_errors(object)
          return unless object.errors.any?
          flash[:error] ||= []
          flash[:error].concat(object.errors.full_messages)
      end
    end

    class ActiveAdmin::ResourceDSL
      alias_method :old_run_registration_block, :run_registration_block
      def run_registration_block(&block)
        old_run_registration_block(&block)
        instance_exec { after_destroy :check_model_errors }
      end
#+END_SRC

* 相关资源

- GitHub: [[https://github.com/activeadmin/activeadmin]]
- 官方文档：[[https://activeadmin.info/index.html]]
- 示例网址：[[https://demo.activeadmin.info]]
- 邮箱列表：[[https://groups.google.com/group/activeadmin]]
- 其他相关：http://blog.csdn.net/feng88724/article/details/49124281

* References

#+BEGIN_QUOTE
  本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
  笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
#+END_QUOTE

- https://www.jianshu.com/p/0512a168733d
- https://blog.csdn.net/feng88724/article/details/49101487
- https://blog.csdn.net/life_is_crazy/article/details/72778227
