_posts/dev/2018-11-22-rails-activeadmin.html

<div id="outline-container-org98c78e7" class="outline-2">
<h2 id="org98c78e7"><span class="section-number-2">11</span> 增加全局错误信息提示</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org02cae66" class="outline-3">
<h3 id="org02cae66"><span class="section-number-3">11.1</span> 定义错误</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">User</span> &lt; <span style="color: #ce537a; font-weight: bold;">ActiveRecord</span>::<span style="color: #ce537a; font-weight: bold;">Base</span>
  before_destroy <span style="color: #a45bad;">:before_destroy_check</span>

  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">before_destroy_check</span>
    errors.add<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">:base</span>, <span style="color: #2d9574;">'&#19981;&#33021;&#21024;&#38500;&#31649;&#29702;&#21592;'</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">if</span> id &lt; <span style="color: #a45bad;">2</span>
    <span style="color: #4f97d7;">throw</span> <span style="color: #a45bad;">:abort</span> <span style="color: #4f97d7; font-weight: bold;">if</span> errors.anyblank?
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org22eae37" class="outline-3">
<h3 id="org22eae37"><span class="section-number-3">11.2</span> 显示错误</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-ruby">form <span style="color: #4f97d7; font-weight: bold;">do</span> |f|
  f.semantic_errors *f.object.errors.keys
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
或者直接打补丁
</p>

<div class="org-src-container">
<pre class="src src-ruby">config/initializers/active_admin_patches.rb.

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>::<span style="color: #ce537a; font-weight: bold;">ResourceController</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">check_model_errors</span><span style="color: #4f97d7;">(</span>object<span style="color: #4f97d7;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">unless</span> object.errors.any?
      flash<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">:error</span><span style="color: #4f97d7;">]</span> ||= <span style="color: #4f97d7;">[]</span>
      flash<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">:error</span><span style="color: #4f97d7;">]</span>.concat<span style="color: #4f97d7;">(</span>object.errors.full_messages<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">ActiveAdmin</span>::<span style="color: #ce537a; font-weight: bold;">ResourceDSL</span>
  <span style="color: #4f97d7;">alias_method</span> <span style="color: #a45bad;">:old_run_registration_block</span>, <span style="color: #a45bad;">:run_registration_block</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run_registration_block</span><span style="color: #4f97d7;">(</span>&amp;block<span style="color: #4f97d7;">)</span>
    old_run_registration_block<span style="color: #4f97d7;">(</span>&amp;block<span style="color: #4f97d7;">)</span>
    instance_exec <span style="color: #4f97d7;">{</span> after_destroy <span style="color: #a45bad;">:check_model_errors</span> <span style="color: #4f97d7;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4fd9407" class="outline-2">
<h2 id="org4fd9407"><span class="section-number-2">12</span> 相关资源</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>GitHub: <a href="https://github.com/activeadmin/activeadmin">https://github.com/activeadmin/activeadmin</a></li>
<li>官方文档：<a href="https://activeadmin.info/index.html">https://activeadmin.info/index.html</a></li>
<li>示例网址：<a href="https://demo.activeadmin.info">https://demo.activeadmin.info</a></li>
<li>邮箱列表：<a href="https://groups.google.com/group/activeadmin">https://groups.google.com/group/activeadmin</a></li>
<li>其他相关：<a href="http://blog.csdn.net/feng88724/article/details/49124281">http://blog.csdn.net/feng88724/article/details/49124281</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7b9206e" class="outline-2">
<h2 id="org7b9206e"><span class="section-number-2">13</span> References</h2>
<div class="outline-text-2" id="text-13">
<blockquote>
<p>
本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
</p>
</blockquote>

<ul class="org-ul">
<li><a href="https://www.jianshu.com/p/0512a168733d">https://www.jianshu.com/p/0512a168733d</a></li>
<li><a href="https://blog.csdn.net/feng88724/article/details/49101487">https://blog.csdn.net/feng88724/article/details/49101487</a></li>
<li><a href="https://blog.csdn.net/life_is_crazy/article/details/72778227">https://blog.csdn.net/life_is_crazy/article/details/72778227</a></li>
</ul>
</div>
</div>
